//

/////
/* MK 의료 시설 차트 추가 sc_a_6_1, sc_a_6_0 */
//
function sc_a_6_1(){
  let p = {};
  p.ctx = "sc_a_6_1"; //순창_지역 정주 여건 정보_의료_2nd 차트
  p.type    = "bar";
  p.width   = 570;
  p.height  = 200;
  p.title   = "순창군 읍면동별 교통시설 접근성 비교";
  p.subTitle= "자가용 이용시 소요시간(분)";
  p.deli    = 3;
  p.labels  = ["순창군","구림면","금과면","동계면","복흥면","쌍치면","유등면","인계면","적성면","팔덕면","풍산면"];
  p.innerLabels = ["공공의료","일반병원","종합병원"];
  p.innerDatas  = ["22.22154286","40.79171429","75.22531429","22.47","54.74","80.92","16.91","48.67","66.34","26.27","28.86","85.08","29.64","30.34","68.59","40.73","44.81","86.05","22.74","27.72","81.06","16.71","45.06","74.88","17.57","36.51","74.97","14.63","45.55","71.31","12.81","37.69","65.3"];
  p.innerColors = ["rgb(136, 210, 206)","rgb(163, 186, 224)","rgb(247, 179, 184)"];

  pageObj.drawChart(p);
};
sc_a_6_1();

/////

//
/*
function sc_a_6_0(){
  let p = {};
  p.ctx = "sc_a_6_0"; //순창_지역 정주 여건 정보_의료_1st 차트 
  p.type = "bar";
  p.width = 270;
  p.height = 200;
  p.title = "순창읍 의료시설 접근시간";
  p.subTitle = "자가용 이용시 소요시간(분)";
  p.deli = 0;
  p.labels  = ["공공의료","일반병원","종합병원"];
  p.datas   = ["3.85","32.82","60.64"];
  p.colors  = ["rgb(136, 210, 206)","rgb(163, 186, 224)","rgb(247, 179, 184)"];

  pageObj.drawChart(p);
};
sc_a_6_0();
*/

function sc_a_5_1(){
  let p = {};
  p.ctx = "sc_a_5_1"; //순창_지역 정주 여건 정보_문화_2nd 차트
  p.type    = "bar";
  p.width   = 570;
  p.height  = 200;
  p.title   = "순창군 읍면동별 문화시설 비교";
  p.subTitle= "";
  p.deli    = 4;
  p.labels  = ["순창군","구림면","금과면","동계면","복흥면","쌍치면","유등면","인계면","적성면","팔덕면","풍산면"];
  p.innerLabels = ["문화의집","도서관","박물관","지방문화원"];
  p.innerDatas  = ["1","2","2","1","","","","","","","","","","","","","","","2","","","","","","","","","","","","","","","","","","","","","","","","",""];
  p.innerColors = ["rgb(136, 210, 206)","rgb(163, 186, 224)","rgb(247, 179, 184)","rgb(255, 159, 255)"];

  pageObj.drawChart(p);
};
sc_a_5_1();


/////

//
function sc_a_5_0(){
  let p = {};
  p.ctx = "sc_a_5_0"; //순창_지역 정주 여건 정보_문화_1st 차트 
  p.type = "bar";
  p.width = 270;
  p.height = 200;
  p.title = "순창읍 문화시설 수";
  p.subTitle = "";
  p.deli = 0;
  p.labels  = ["문화의집","도서관","박물관","지방문화원"];
  p.datas   = ["1","2","1","1"];
  p.colors  = ["rgb(136, 210, 206)","rgb(163, 186, 224)","rgb(247, 179, 184)","rgb(255, 159, 255)"];

  pageObj.drawChart(p);
};
sc_a_5_0();


/////

//
function sc_a_4_1(){
  let p = {};
  p.ctx = "sc_a_4_1"; //순창_지역 정주 여건 정보_편의_2nd 차트
  p.type    = "bar";
  p.width   = 570;
  p.height  = 200;
  p.title   = "순창군 읍면동별 마트시설 접근성 비교";
  p.subTitle= "자가용 이용시 소요시간(분)";
  p.deli    = 2;
  p.labels  = ["순창군","구림면","금과면","동계면","복흥면","쌍치면","유등면","인계면","적성면","팔덕면","풍산면"];
  p.innerLabels = ["대형점포","전통시장"];
  p.innerDatas  = ["44.32828571","30.4556","53.75","39.22","45.99","25.93","41.1","30.14","46.95","42.37","48.05","34.52","28.93","29.24","47.68","32.68","42.78","31.72","44.26","29.87","40.17","14.98"];
  p.innerColors = ["rgb(136, 210, 206)","rgb(163, 186, 224)"];

  pageObj.drawChart(p);
};
sc_a_4_1();


/////

//
function sc_a_4_0(){
  let p = {};
  p.ctx = "sc_a_4_0"; //순창_지역 정주 여건 정보_편의_1st 차트 
  p.type = "bar";
  p.width = 270;
  p.height = 200;
  p.title = "순창읍 마트시설 접근시간";
  p.subTitle = "자가용 이용시 소요시간(분)";
  p.deli = 0;
  p.labels  = ["대형점포","전통시장"];
  p.datas   = ["31.53","17.79"];
  p.colors  = ["rgb(136, 210, 206)","rgb(163, 186, 224)"];

  pageObj.drawChart(p);
};
sc_a_4_0();


/////

//
function sc_a_3_1(){
  let p = {};
  p.ctx = "sc_a_3_1"; //순창_지역 정주 여건 정보_교통_2nd 차트
  p.type    = "bar";
  p.width   = 570;
  p.height  = 200;
  p.title   = "순창군 읍면동별 교통시설 접근성 비교";
  p.subTitle= "자가용 이용시 소요시간(분)";
  p.deli    = 3;
  p.labels  = ["순창군","구림면","금과면","동계면","복흥면","쌍치면","유등면","인계면","적성면","팔덕면","풍산면"];
  p.innerLabels = ["버스터미널","기차역","공항"];
  p.innerDatas  = ["22.22154286","40.79171429","75.22531429","22.47","54.74","80.92","16.91","48.67","66.34","26.27","28.86","85.08","29.64","30.34","68.59","40.73","44.81","86.05","22.74","27.72","81.06","16.71","45.06","74.88","17.57","36.51","74.97","14.63","45.55","71.31","12.81","37.69","65.3"];
  p.innerColors = ["rgb(136, 210, 206)","rgb(163, 186, 224)","rgb(247, 179, 184)"];

  pageObj.drawChart(p);
};
sc_a_3_1();


/////

//
function sc_a_3_0(){
  let p = {};
  p.ctx = "sc_a_3_0"; //순창_지역 정주 여건 정보_교통_1st 차트 
  p.type = "bar";
  p.width = 270;
  p.height = 200;
  p.title = "순창읍 교통시설 접근시간";
  p.subTitle = "자가용 이용시 소요시간(분)";
  p.deli = 0;
  p.labels  = ["버스터미널","기차역","공항"];
  p.datas   = ["3.85","32.82","60.64"];
  p.colors  = ["rgb(136, 210, 206)","rgb(163, 186, 224)","rgb(247, 179, 184)"];

  pageObj.drawChart(p);
};
sc_a_3_0();

//

/////
/* MK 교육 시설 차트 추가 sc_a_2_2, sc_a_2_3 */
//
function sc_a_2_3(){
  let p = {};
  p.ctx = "sc_a_2_3"; //순창_지역 정주 여건 정보_교육_4nd 차트
  p.type    = "bar";
  p.width   = 570;
  p.height  = 200;
  p.title   = "순창군 읍면동별 교육시설 비교";
  p.subTitle= "";
  p.deli    = 1;
  p.labels  = ["순창군","구림면","금과면","동계면","복흥면","쌍치면","유등면","인계면","적성면","팔덕면","풍산면"];
  p.innerLabels = ["학원 및 교습소"];
  p.innerDatas  = ["1","2","2","1","","","","","","","","","","","","","","","2","","","","","","","","","","","","","","","","","","","","","","","","",""];
  p.innerColors = ["rgb(136, 210, 206)"];

  pageObj.drawChart(p);
};
sc_a_2_3();

/////

//

function sc_a_2_2(){
  let p = {};
  p.ctx = "sc_a_2_2"; //순창_지역 정주 여건 정보_문화_3st 차트 
  p.type = "bar";
  p.width = 270;
  p.height = 200;
  p.title = "순창읍 교육시설 수";
  p.subTitle = "";
  p.deli = 0;
  p.labels  = ["학원 및 교습소"];
  p.datas   = ["1"];
  p.colors  = ["rgb(136, 210, 206)"];

  pageObj.drawChart(p);
};
sc_a_2_2();


/////

//
function sc_a_2_1(){
  let p = {};
  p.ctx = "sc_a_2_1"; //순창_지역 정주 여건 정보_교육_2nd 차트
  p.type    = "bar";
  p.width   = 570;
  p.height  = 200;
  p.title   = "순창군 읍면동별 교육시설 접근성 비교";
  p.subTitle= "자가용 이용시 소요시간(분)";
  p.deli    = 3;
  p.labels  = ["순창군","구림면","금과면","동계면","복흥면","쌍치면","유등면","인계면","적성면","팔덕면","풍산면"];
  p.innerLabels = ["초","중","고"];
  p.innerDatas  = ["7.521771429","10.63851429","19.23994286","7.93","7.79","24.29","5.09","15.47","17.81","7.86","6.59","5.08","7.04","7.35","34.93","9.7","8.68","35.7","14.3","20.5","20.67","10.97","15.45","14.08","8.57","15.22","15.16","4.94","14.58","15.41","5.38","12.31","12.84"];
  p.innerColors = ["rgb(136, 210, 206)","rgb(163, 186, 224)","rgb(247, 179, 184)"];

  pageObj.drawChart(p);
};
sc_a_2_1();


/////

//
function sc_a_2_0(){
  let p = {};
  p.ctx = "sc_a_2_0"; //순창_지역 정주 여건 정보_교육_1st 차트 
  p.type = "bar";
  p.width = 270;
  p.height = 200;
  p.title = "순창읍 교육시설별 접근시간";
  p.subTitle = "자가용 이용시 소요시간(분)";
  p.deli = 0;
  p.labels  = ["초","중","고"];
  p.datas   = ["2.66","3.24","3.09"];
  p.colors  = ["rgb(136, 210, 206)","rgb(163, 186, 224)","rgb(247, 179, 184)"];

  pageObj.drawChart(p);
};
sc_a_2_0();


/////

//
function sc_a_1_2(){
  let p = {};
  p.ctx = "sc_a_1_2"; //순창_지역 정주 여건 정보_귀농인_3rd 차트 
  p.type = "bar";
  p.width = 270;
  p.height = 200;
  p.title = "귀농인 재배 품목";
  p.subTitle = "(명)";
  p.deli = 0;
  p.labels  = ["벼","건고추","두릅","들깨","매실"];
  p.datas   = ["37","33","22","8","8"];
  p.colors  = ["rgb(136, 210, 206)"];

  pageObj.drawChart(p);
};
sc_a_1_2();


/////

//
function sc_a_1_1(){
  let p = {};
  p.ctx = "sc_a_1_1"; //순창_지역 정주 여건 정보_귀농인_2nd 차트 
  p.type = "bar";
  p.width = 270;
  p.height = 200;
  p.title = "귀농인 전출 지역";
  p.subTitle = "(명)";
  p.deli = 0;
  p.labels  = ["전라북도","광주","서울","경기도","전라남도"];
  p.datas   = ["97","22","20","18","8"];
  p.colors  = ["rgb(136, 210, 206)"];

  pageObj.drawChart(p);
};
sc_a_1_1();


/////

//
function sc_a_1_0(){
  let p = {};
  p.ctx = "sc_a_1_0"; //순창_지역 정주 여건 정보_귀농인_1st 차트 
  p.type = "bar";
  p.width = 270;
  p.height = 200;
  p.title = "순창군 연령대별 귀농인";
  p.subTitle = "(명)";
  p.deli = 0;
  p.labels  = ["20대","30대","40대","50대","60대이상"];
  p.datas   = ["4","17","33","50","71"];
  p.colors  = ["rgb(136, 210, 206)"];

  pageObj.drawChart(p);
};
sc_a_1_0();


/////


//
function sc_a_0_3(){
  let p = {};
  p.ctx = "sc_a_0_3"; //순창_지역 정주 여건 정보_농지가격_4th 차트
  p.type    = "bar";
  p.width   = 570;
  p.height  = 200;
  p.title   = "순창군 읍면동별 농지 임대가격 비교";
  p.subTitle= "평균 거래가격(원/3.3㎥)";
  p.showText = 'N';
  p.deli    = 3;
  p.labels  = ["순창군","구림면","금과면","동계면","복흥면","쌍치면","유등면","인계면","적성면","팔덕면","풍산면"];
  p.innerLabels = ["전","답","과수"];
  p.innerDatas  = ["14.01818182","151.4363636","","10.2","122.8","","34","127.6","0","0","79.5","","57.7","234.3","","49.4","159.2","280","0","142.7","","0","150.6","","0","188","","0","233.4","","2.9","111.8",""];
  p.innerColors = ["rgb(136, 210, 206)","rgb(163, 186, 224)","rgb(247, 179, 184)"];

  pageObj.drawChart(p);
};
sc_a_0_3();


/////

//
function sc_a_0_2(){
  let p = {};
  p.ctx = "sc_a_0_2"; //순창_지역 정주 여건 정보_농지가격_3rd 차트 
  p.type = "bar";
  p.width = 270;
  p.height = 200;
  p.title = "순창읍 농지 임대가격";
  p.subTitle = "평균 거래가격(원/3.3㎥)";
  p.deli = 0;
  p.labels  = ["전","답","과수"];
  p.datas   = ["0","115.9",""];
  p.colors  = ["rgb(136, 210, 206)","rgb(163, 186, 224)","rgb(247, 179, 184)"];

  pageObj.drawChart(p);
};
sc_a_0_2();


/////

//
function sc_a_0_1(){
  let p = {};
  p.ctx = "sc_a_0_1"; //순창_지역 정주 여건 정보_농지가격_2nd 차트
  p.type    = "bar";
  p.width   = 570;
  p.height  = 200;
  p.title   = "순창군 읍면동별 농지 실거래 가격 비교";
  p.subTitle= "평균 거래가격(원/3.3㎥)";
  p.showText = 'N';
  p.deli    = 3;
  p.labels  = ["순창군 ","구림면","금과면","동계면","복흥면","쌍치면","유등면","인계면","적성면","팔덕면","풍산면"];
  p.innerLabels = ["전","답","과수"];
  p.innerDatas  = ["92643.15455","108936.2636","","42150.3","49553.6","","67833.4","51913.6","","40738.4","49459.8","","30464.6","47260.7","","76865.4","49316","","33417.7","69851.6","","34720","45341.1","","40760.5","48028.7","","68545.8","55954.3","","36775.2","49839.3",""];
  p.innerColors = ["rgb(136, 210, 206)","rgb(163, 186, 224)","rgb(247, 179, 184)"];

  pageObj.drawChart(p);
};
sc_a_0_1();


/////

//
function sc_a_0_0(){
  let p = {};
  p.ctx = "sc_a_0_0"; //순창_지역 정주 여건 정보_농지가격_1st 차트 
  p.type = "bar";
  p.width = 270;
  p.height = 200;
  p.title = "순창읍 농지 실거래 가격";
  p.subTitle = "평균 거래가격(원/3.3㎥)";
  p.deli = 0;
  p.labels  = ["전","답","과수"];
  p.datas   = ["546803.4","681780.2",""];
  p.colors  = ["rgb(136, 210, 206)","rgb(163, 186, 224)","rgb(247, 179, 184)"];

  pageObj.drawChart(p);
};
sc_a_0_0();


/////

