/**
 * 예천 - 지역 정주 여건 정보 
 */
//
function yc_a_5_1(){
  let p = {};
  p.ctx = "yc_a_5_1"; //예천_지역 정주 여건 정보_문화_2nd 차트
  p.type    = "bar";
  p.width   = 570;
  p.height  = 200;
  p.title   = "순창군 읍면동별 문화시설 비교";
  p.subTitle= "";
  p.deli    = 4;
  p.labels  = ["예천군","감천면","개포면","보문면","예천읍","용궁면","용문면","유천면","은풍면","지보면","풍양면","효자면"];
  p.innerLabels = ["문화의집","도서관","박물관","지방문화원"];
  p.innerDatas  = ["","","","","","","1","","","","","","","","","","","1","","1","","","","","","","","","","","","","","","","","","","","","","","","","","","",""];
  p.innerColors = ["rgb(136, 210, 206)","rgb(163, 186, 224)","rgb(247, 179, 184)","rgb(255, 159, 255)"];

  pageObj.drawChart(p);
};
yc_a_5_1();


/////

//
function yc_a_5_0(){
  let p = {};
  p.ctx = "yc_a_5_0"; //예천_지역 정주 여건 정보_문화_1st 차트 
  p.type = "bar";
  p.width = 270;
  p.height = 200;
  p.title = "순창읍 문화시설 수";
  p.subTitle = "";
  p.deli = 0;
  p.labels  = ["문화의집","도서관","박물관","지방문화원"];
  p.datas   = ["","","",""];
  p.colors  = ["rgb(136, 210, 206)","rgb(163, 186, 224)","rgb(247, 179, 184)","rgb(255, 159, 255)"];

  pageObj.drawChart(p);
};
yc_a_5_0();


/////

//
function yc_a_4_3(){
  let p = {};
  p.ctx = "yc_a_4_3"; //예천_지역 정주 여건 정보_편의_4th 차트
  p.type    = "bar";
  p.width   = 570;
  p.height  = 200;
  p.title   = "순창군 읍면동별 편의시설 비교";
  p.subTitle= "";
  p.deli    = 3;
  p.labels  = ["예천군","감천면","개포면","보문면","예천읍","용궁면","용문면","유천면","은풍면","지보면","풍양면","효자면"];
  p.innerLabels = ["대형점포","전통시장","대형점포"];
  p.innerDatas  = ["33.73315152","14.8130303","22.45","18.37","28.76","15.52","31.03","20.72","31.5","3.65","22.05","6.66","42.28","17.74","35.24","16.46","45.15","21.9","49.55","18.39","36.14","6.94","53.5","35.76"];
  p.innerColors = ["rgb(136, 210, 206)","rgb(163, 186, 224)","rgb(247, 179, 184)"];

  pageObj.drawChart(p);
};
yc_a_4_3();


/////

//
function yc_a_4_0(){
  let p = {};
  p.ctx = "yc_a_4_0"; //예천_지역 정주 여건 정보_편의_1st 차트 
  p.type = "bar";
  p.width = 270;
  p.height = 200;
  p.title = "순창읍 마트시설 접근 시간";
  p.subTitle = "자가용 이용시 소요시간(분)";
  p.deli = 0;
  p.labels  = ["대형점포","전통시장"];
  p.datas   = ["32.44","12.85"];
  p.colors  = ["rgb(136, 210, 206)","rgb(163, 186, 224)"];

  pageObj.drawChart(p);
};
yc_a_4_0();


/////

//
function yc_a_3_1(){
  let p = {};
  p.ctx = "yc_a_3_1"; //예천_지역 정주 여건 정보_교통_2nd 차트
  p.type    = "bar";
  p.width   = 570;
  p.height  = 200;
  p.title   = "순창읍 읍면동별 교통시설 접근성 비교";
  p.subTitle= "자가용 이용시 소요시간(분)";
  p.deli    = 3;
  p.labels  = ["예천군","감천면","개포면","보문면","예천읍","용궁면","용문면","유천면","은풍면","지보면","풍양면","효자면"];
  p.innerLabels = ["버스터미널","기차역","공항"];
  p.innerDatas  = ["21.98509091","19.66266667","10.85545455","20.07","20.37","0","16.63","10.75","0","22.69","22.88","0","4.81","5.02","0","20.36","7.03","119.41","20.47","20.67","0","14.61","13.79","0","24.62","24.81","0","28.13","28.51","0","34.04","28.69","0","41.18","36.7","0"];
  p.innerColors = ["rgb(136, 210, 206)","rgb(163, 186, 224)","rgb(247, 179, 184)"];

  pageObj.drawChart(p);
};
yc_a_3_1();


/////

//
function yc_a_3_0(){
  let p = {};
  p.ctx = "yc_a_3_0"; //예천_지역 정주 여건 정보_교통_1st 차트 
  p.type = "bar";
  p.width = 270;
  p.height = 200;
  p.title = "순창읍 교통시설 접근 시간";
  p.subTitle = "자가용 이용시 소요시간(분)";
  p.deli = 0;
  p.labels  = ["버스터미널","기차역","공항"];
  p.datas   = ["3.85","32.82","60.64"];
  p.colors  = ["rgb(136, 210, 206)","rgb(163, 186, 224)","rgb(247, 179, 184)"];

  pageObj.drawChart(p);
};
yc_a_3_0();


/////

//
function yc_a_2_1(){
  let p = {};
  p.ctx = "yc_a_2_1"; //예천_지역 정주 여건 정보_교육_2nd 차트
  p.type    = "bar";
  p.width   = 570;
  p.height  = 200;
  p.title   = "순창읍 읍면동별 교육시설 접근성 비교";
  p.subTitle= "자가용 이용시 소요시간(분)";
  p.deli    = 3;
  p.labels  = ["예천군","감천면","개포면","보문면","예천읍","용궁면","용문면","유천면","은풍면","지보면","풍양면","효자면"];
  p.innerLabels = ["초","중","고"];
  p.innerDatas  = ["8.996484848","9.633333333","18.3990303","7.51","9.18","17.83","12.99","16.38","20.95","18.76","17.91","19.73","3.2","3.92","4.28","9.6","8.01","16.95","6.69","5.68","15.55","6.27","14.83","18.72","5.74","5.48","19.9","10.79","11.69","26.5","7.42","7.11","32.95","16.32","18.65","36.26"];
  p.innerColors = ["rgb(136, 210, 206)","rgb(163, 186, 224)","rgb(247, 179, 184)"];

  pageObj.drawChart(p);
};
yc_a_2_1();


/////

//
function yc_a_2_0(){
  let p = {};
  p.ctx = "yc_a_2_0"; //예천_지역 정주 여건 정보_교육_1st 차트 
  p.type = "bar";
  p.width = 270;
  p.height = 200;
  p.title = "순창읍 교육시설별 접근시간";
  p.subTitle = "자가용 이용시 소요시간(분)";
  p.deli = 0;
  p.labels  = ["초","중","고"];
  p.datas   = ["4.48","4.98","5.47"];
  p.colors  = ["rgb(136, 210, 206)","rgb(163, 186, 224)","rgb(247, 179, 184)"];

  pageObj.drawChart(p);
};
yc_a_2_0();


/////

//
function yc_a_1_2(){
  let p = {};
  p.ctx = "yc_a_1_2"; //예천_지역 정주 여건 정보_귀농인_3rd 차트 
  p.type = "bar";
  p.width = 270;
  p.height = 200;
  p.title = "귀농인 재배 품목";
  p.subTitle = "명";
  p.deli = 0;
  p.labels  = ["벼","건고추","참깨","사과","감자","들깨","콩","쪽파","땅콩","복숭아","떫은감","고구마","호두","조미채소류 기타","도라지","복분자","생강","대추","양파","가을무","작약","김장(가을)배추","과실류 기타","강활","담배","선인장","더덕","소나무","두충나무","마늘","토란","엽경채류 기타","자두","매실"];
  p.datas   = ["58","15","13","11","10","6","4","4","4","3","3","3","3","2","2","2","2","2","2","2","1","1","1","1","1","1","1","1","1","1","1","1","1","1"];
  p.colors  = ["rgb(136, 210, 206)"];

  pageObj.drawChart(p);
};
yc_a_1_2();


/////

//
function yc_a_1_1(){
  let p = {};
  p.ctx = "yc_a_1_1"; //예천_지역 정주 여건 정보_귀농인_2nd 차트 
  p.type = "bar";
  p.width = 270;
  p.height = 200;
  p.title = "귀농인 전출 지역";
  p.subTitle = "명";
  p.deli = 0;
  p.labels  = ["경상북도","서울특별시","대구광역시","경기도","경상남도","부산광역시","충청북도","강원도","인천광역시","전라북도","울산광역시","대전광역시","충청남도"];
  p.datas   = ["90","21","18","13","5","4","4","3","2","2","1","1","1"];
  p.colors  = ["rgb(136, 210, 206)"];

  pageObj.drawChart(p);
};
yc_a_1_1();


/////

//
function yc_a_1_0(){
  let p = {};
  p.ctx = "yc_a_1_0"; //예천_지역 정주 여건 정보_귀농인_1st 차트 
  p.type = "bar";
  p.width = 270;
  p.height = 200;
  p.title = "순창군 연령대별 귀농인";
  p.subTitle = "명";
  p.deli = 0;
  p.labels  = ["20대","30대","40대","50대","60대이상"];
  p.datas   = ["1","2","4","9","9"];
  p.colors  = ["rgb(136, 210, 206)"];

  pageObj.drawChart(p);
};
yc_a_1_0();


/////

//
function yc_a_0_3(){
  let p = {};
  p.ctx = "yc_a_0_3"; //예천_지역 정주 여건 정보_농지가격_4th 차트
  p.type    = "bar";
  p.width   = 570;
  p.height  = 200;
  p.title   = "예천군 읍면동별 농지 임대가격 비교";
  p.subTitle= "평균 거래가격(원/3.3㎥)";
  p.showText = 'N';
  p.deli    = 3;
  p.labels  = ["예천군","감천면","개포면","보문면","예천읍","용궁면","용문면","유천면","은풍면","지보면","풍양면","효자면"];
  p.innerLabels = ["전","답","과수"];
  p.innerDatas  = ["44.29272727","103.1848485","48.27627119","115.2","133.2","72.2","93.3","143","0","17.9","86.4","","100.6","142.6","0","0","123.6","112.9","41.7","63.9","110.4","33","150.8","","68.4","124.1","150.4","32.4","109.6","","7.2","49.5","0","0","39","31.9"];
  p.innerColors = ["rgb(136, 210, 206)","rgb(163, 186, 224)","rgb(247, 179, 184)"];

  pageObj.drawChart(p);
};
yc_a_0_3();


/////

//
function yc_a_0_2(){
  let p = {};
  p.ctx = "yc_a_0_2"; //예천_지역 정주 여건 정보_농지가격_3rd 차트 
  p.type = "bar";
  p.width = 270;
  p.height = 200;
  p.title = "호명면 농지 임대가격";
  p.subTitle = "평균 거래가격(원/3.3㎥)";
  p.deli = 0;
  p.labels  = ["전","답","과수"];
  p.datas   = ["35.2","110.5","0"];
  p.colors  = ["rgb(136, 210, 206)","rgb(163, 186, 224)","rgb(247, 179, 184)"];

  pageObj.drawChart(p);
};
yc_a_0_2();


/////

//
function yc_a_0_1(){
  let p = {};
  p.ctx = "yc_a_0_1"; //예천_지역 정주 여건 정보_농지가격_2nd 차트
  p.type    = "bar";
  p.width   = 570;
  p.height  = 200;
  p.title   = "예천군 읍면동별 농지 실거래가 비교";
  p.subTitle= "평균 거래가격(원/3.3㎥)";
  p.showText = 'N';
  p.deli    = 3;
  p.labels  = ["예천군","감천면","개포면","보문면","예천읍","용궁면","용문면","유천면","은풍면","지보면","풍양면","효자면"];
  p.innerLabels = ["전","답","과수"];
  p.innerDatas  = ["82850.78493","96408.82484","107129.83","93281.2","76906.5","134772.5","57842.9","72640.7","","73769.9","55446","","","","","79918.4","89478.2","","66532.3","89771.6","","104110","72631.9","","100949.8","75879.7","","110513.3","97105.3","59383.4","50333.8","67737.4","","","39494.9",""];
  p.innerColors = ["rgb(136, 210, 206)","rgb(163, 186, 224)","rgb(247, 179, 184)"];

  pageObj.drawChart(p);
};
yc_a_0_1();


/////

//
function yc_a_0_0(){
  let p = {};
  p.ctx = "yc_a_0_0"; //예천_지역 정주 여건 정보_농지가격_1st 차트 
  p.type = "bar";
  p.width = 270;
  p.height = 200;
  p.title = "호명면 농지 실거래가";
  p.subTitle = "평균 거래가격(원/3.3㎥)";
  p.deli = 0;
  p.labels  = ["전","답","과수"];
  p.datas   = ["109499.2","209339.9",""];
  p.colors  = ["rgb(136, 210, 206)","rgb(163, 186, 224)","rgb(247, 179, 184)"];

  pageObj.drawChart(p);
};
yc_a_0_0();


/////

